[{"url": "https://en.wikipedia.org/wiki/History_of_India", "paragraph": "According to consensus in modern genetics, anatomically modern humans first arrived on the Indian subcontinent from Africa between 73,000 and 55,000 years ago.  However, the earliest known human remains in South Asia date to 30,000 years ago.  Settled life, which involves the transition from foraging to farming and pastoralism, began in South Asia around 7,000 BCE.  At the site of Mehrgarh presence can be documented of the domestication of wheat and barley, rapidly followed by that of goats, sheep, and cattle. By 4,500 BCE, settled life had spread more widely, and began to gradually evolve into the Indus Valley Civilization, an early civilization of the Old world, which was contemporaneous with Ancient Egypt and Mesopotamia. This civilisation flourished between 2,500 BCE and 1900 BCE in what today is Pakistan and north-western India, and was noted for its urban planning, baked brick houses, elaborate drainage, and water supply.In early second millennium BCE persistent drought caused the population of the Indus Valley to scatter from large urban centres to villages. Around the same time, Indo-Aryan tribes moved into the Punjab from Central Asia in several waves of migration. Their Vedic period (1500-500 BCE) was marked by the composition of the Vedas, large collections of hymns of these tribes. Their varna system, which evolved into the caste system, consisted of a hierarchy of priests, warriors, and free peasants. The pastoral and nomadic Indo-Aryans spread from the Punjab into the Gangetic plain, large swaths of which they deforested for agriculture usage. The composition of Vedic texts ended around 600 BCE, when a new, interregional culture arose. Small chieftaincies, or janapadas, were consolidated into larger states, or mahajanapadas, and a second urbanisation took place. This urbanisation was accompanied by the rise of new ascetic movements in Greater Magadha, including Jainism and Buddhism, which opposed the growing influence of Brahmanism and the primacy of rituals, presided by Brahmin priests, that had come to be associated with Vedic religion, and gave rise to new religious concepts. In response to the success of these movements, Vedic Brahmanism was synthesised with the preexisting religious cultures of the subcontinent, giving rise to Hinduism.\n\nMost of the Indian subcontinent was conquered by the Maurya Empire during the 4th and 3rd centuries BCE. From the 3rd century BCE onwards Prakrit and Pali literature in the north and the Tamil Sangam literature in southern India started to flourish. Wootz steel originated in south India in the 3rd century BCE and was exported to foreign countries. During the Classical period, various parts of India were ruled by numerous dynasties for the next 1,500 years, among which the Gupta Empire stands out. This period, witnessing a Hindu religious and intellectual resurgence, is known as the classical or \"Golden Age of India\". During this period, aspects of Indian civilisation, administration, culture, and religion (Hinduism and Buddhism) spread to much of Asia, while kingdoms in southern India had maritime business links with the Middle East and the Mediterranean. Indian cultural influence spread over many parts of Southeast Asia, which led to the establishment of Indianised kingdoms in Southeast Asia (Greater India).The most significant event between the 7th and 11th century was the Tripartite struggle centred on Kannauj that lasted for more than two centuries between the Pala Empire, Rashtrakuta Empire, and Gurjara-Pratihara Empire. Southern India saw the rise of multiple imperial powers from the middle of the fifth century, most notably the Chalukya, Chola, Pallava, Chera, Pandyan, and Western Chalukya Empires. The Chola dynasty conquered southern India and successfully invaded parts of Southeast Asia, Sri Lanka, the Maldives, and Bengal in the 11th century. In the early medieval period Indian mathematics, including Hindu numerals, influenced the development of mathematics and astronomy in the Arab world.Islamic conquests made limited inroads into modern Afghanistan and Sindh as early as the 8th century, followed by the invasions of Mahmud Ghazni.\nThe Delhi Sultanate was founded in 1206 CE by Central Asian Turks who ruled a major part of the northern Indian subcontinent in the early 14th century, but declined in the late 14th century, and saw the advent of the Deccan Sultanates. The wealthy Bengal Sultanate also emerged as a major power, lasting over three centuries.\nThis period also saw the emergence of several powerful Hindu states, notably Vijayanagara and Rajput states, such as Mewar. The 15th century saw the advent of Sikhism. The early modern period began in the 16th century, when the Mughal Empire conquered most of the Indian subcontinent, signalling the proto-industrialization, becoming the biggest global economy and manufacturing power, with a nominal GDP that valued a quarter of world GDP, superior than the combination of Europe's GDP. The Mughals suffered a gradual decline in the early 18th century, which provided opportunities for the Marathas, Sikhs, Mysoreans, Nizams, and Nawabs of Bengal to exercise control over large regions of the Indian subcontinent.From the mid-18th century to the mid-19th century, large regions of India were gradually annexed by the East India Company, a chartered company acting as a sovereign power on behalf of the British government. Dissatisfaction with company rule in India led to the Indian Rebellion of 1857, which rocked parts of north and central India, and led to the dissolution of the company. India was afterwards ruled directly by the British Crown, in the British Raj. After World War I, a nationwide struggle for independence was launched by the Indian National Congress, led by Mahatma Gandhi, and noted for nonviolence. Later, the All-India Muslim League would advocate for a separate Muslim-majority nation state. The British Indian Empire was partitioned in August 1947 into the Dominion of India and Dominion of Pakistan, each gaining its independence."}, {"url": "https://en.wikipedia.org/wiki/List_of_last_survivors_of_historical_events", "paragraph": "A historical event can be defined as any occurrence from the past regardless of significance, with the term \"history\" an umbrella term relating to past events and any associated memories, discoveries, collections, organizations, presentations, and/or interpretations of them. This differs from a historic event which is often less inclusive, and stands out as having made a significant impact on history itself.The following is a list of notable people documented as the last living individuals to have witnessed, survived or participated in significant historical events or who were the last living members of a historic group that directly contributed to such an event (e.g. Manhattan Project scientists). Excluded from this list are last living survivors of wars, speakers of languages, and others who are already recorded on pages representing more narrow categories.\n  Background shading indicates the individual is still living\n\n"}, {"url": "https://en.wikipedia.org/wiki/List_of_television_shows_based_on_Indian_history", "paragraph": "This is a list of notable television shows based on subjects of Indian history. Some shows listed below are fictionalised or dramatised shows based on historical events and people."}, {"url": "https://en.wikipedia.org/wiki/Indian_Rebellion_of_1857", "paragraph": "The Indian Rebellion of 1857 was a major uprising in India in 1857–58 against the rule of the British East India Company, which functioned as a sovereign power on behalf of the British Crown. The rebellion began on 10 May 1857 in the form of a mutiny of sepoys of the Company's army in the garrison town of Meerut, 40 mi (64 km) northeast of Delhi. It then erupted into other mutinies and civilian rebellions chiefly in the upper Gangetic plain and central India, though incidents of revolt also occurred farther north and east. The rebellion posed a considerable threat to British power in that region, and was contained only with the rebels' defeat in Gwalior on 20 June 1858. On 1 November 1858, the British granted amnesty to all rebels not involved in murder, though they did not declare the hostilities to have formally ended until 8 July 1859. Its name is contested, and it is variously described as the Sepoy Mutiny, the Indian Mutiny, the Great Rebellion, the Revolt of 1857, the Indian Insurrection, and the First War of Independence.The Indian rebellion was fed by resentments born of diverse perceptions, including invasive British-style social reforms, harsh land taxes, summary treatment of some rich landowners and princes, as well as scepticism about the improvements brought about by British rule. Many Indians rose against the British; however, many also fought for the British, and the majority remained seemingly compliant to British rule. Violence, which sometimes betrayed exceptional cruelty, was inflicted on both sides, on British officers, and civilians, including women and children, by the rebels, and on the rebels, and their supporters, including sometimes entire villages, by British reprisals; the cities of Delhi and Lucknow were laid waste in the fighting and the British retaliation.After the outbreak of the mutiny in Meerut, the rebels quickly reached Delhi, whose 81-year-old Mughal ruler, Bahadur Shah Zafar, was declared the Emperor of Hindustan. Soon, the rebels had captured large tracts of the North-Western Provinces and Awadh (Oudh). The East India Company's response came rapidly as well. With help from reinforcements, Kanpur was retaken by mid-July 1857, and Delhi by the end of September. However, it then took the remainder of 1857 and the better part of 1858 for the rebellion to be suppressed in Jhansi, Lucknow, and especially the Awadh countryside. Other regions of Company-controlled India—Bengal province, the Bombay Presidency, and the Madras Presidency—remained largely calm. In Assam, a plan to reinstate the Ahom kingdom taking advantage of the situation elsewhere in India was set up, but it died off with the hanging of Maniram Dewan and Piyali Barua, and the subsequent forceful crushing of public reaction. In the Punjab, the Sikh princes crucially helped the British by providing both soldiers and support. The large princely states, Hyderabad, Mysore, Travancore, and Kashmir, as well as the smaller ones of Rajputana, did not join the rebellion, serving the British, in the Governor-General Lord Canning's words, as \"breakwaters in a storm.\"In some regions, most notably in Awadh, the rebellion took on the attributes of a patriotic revolt against British oppression. However, the rebel leaders proclaimed no articles of faith that presaged a new political system. Even so, the rebellion proved to be an important watershed in Indian and British Empire history. It led to the dissolution of the East India Company, and forced the British to reorganize the army, the financial system, and the administration in India, through passage of the Government of India Act 1858. India was thereafter administered directly by the British government in the new British Raj. On 1 November 1858, Queen Victoria issued a proclamation to Indians, which while lacking the authority of a constitutional provision, promised rights similar to those of other British subjects. In the following decades, when admission to these rights was not always forthcoming, Indians were to pointedly refer to the Queen's proclamation in growing avowals of a new nationalism.\n\n"}, {"url": "https://en.wikipedia.org/wiki/Indian_reservation", "paragraph": "An Indian reservation is an area of land held and governed by a federally recognised Native American tribal nation which government is accountable to the U.S. Bureau of Indian Affairs and not to the state government in which it is located. Some of the country's 574 federally recognized tribes govern more than one \nof the 326 Indian reservations in the United States, while some share reservations, and others have no reservation at all. Historical piecemeal land allocations under the Dawes Act facilitated sales to non–Native Americans, resulting in some reservations becoming severely fragmented, with pieces of tribal and privately held land being treated as separate enclaves. This jumble of private and public real estate creates significant administrative, political and legal difficulties.The total area of all reservations is 56,200,000 acres (22,700,000 ha; 87,800 sq mi; 227,000 km2), approximately 2.3% of the total area of the United States and about the size of the state of Idaho. While most reservations are small compared to the average U.S. state, twelve Indian reservations are larger than the state of Rhode Island. The largest reservation, the Navajo Nation Reservation, is similar in size to the state of West Virginia. Reservations are unevenly distributed throughout the country, the majority being situated west of the Mississippi River and occupying lands that were first reserved by treaty (Indian Land Grants) from the public domain.Because recognized Native American nations possess tribal sovereignty, albeit of a limited degree, laws within tribal lands may vary from those of the surrounding and adjacent states. For example, these laws can permit casinos on reservations located within states which do not allow gambling, thus attracting tourism. The tribal council generally has jurisdiction over the reservation, not the state or federal government of the United States. Different reservations have different systems of government, which may or may not replicate the forms of government found outside the reservation. Most Native American reservations were established by the federal government but a small number, mainly in the East, owe their origin to state recognition.The term \"reservation\" is a legal designation. It comes from the conception of the Native American nations as independent sovereigns at the time the U.S. Constitution was ratified.  Thus, early peace treaties (often signed under conditions of duress or fraud), in which Native American nations surrendered large portions of their land to the United States, designated parcels which the nations, as sovereigns, \"reserved\" to themselves, and those parcels came to be called \"reservations\".  The term remained in use after the federal government began to forcibly relocate nations to parcels of land to which they had no historical connection.\nToday the majority of American Indians and Alaska Natives live outside the reservations, mainly in the larger western cities such as Phoenix and Los Angeles. In 2012, there were over 2.5 million Native Americans, with 1 million living on reservations."}, {"url": "https://en.wikipedia.org/wiki/Historical_reenactment", "paragraph": "Historical reenactment (or re-enactment) is an educational or entertainment activity in which mainly amateur hobbyists and history enthusiasts put on uniforms and follow a plan to recreate aspects of a historical event or period. This may be as narrow as a specific moment from a battle, such as the reenactment of Pickett's Charge presented during the Great Reunion of 1913, or as broad as an entire period, such as Regency reenactment. \nWhile historical reenactors are generally amateurs, some participants are members of armed forces or historians. The participants, called reenactors, often do research on the equipment, uniform, and other gear they will carry or use. Reenactors buy the apparel or items they need from specialty stores or make items themselves. Historical reenactments cover a wide span of history, from the Roman empire to the major world wars and the Korean War of the 20th century."}, {"url": "https://en.wikipedia.org/wiki/List_of_films_based_on_actual_events_(2000%E2%80%93present)", "paragraph": "This is a list of films and miniseries that are based on actual events. All films on this list are from American production unless indicated otherwise.\n\n"}, {"url": "https://en.wikipedia.org/wiki/Indian_Rocks_Beach,_Florida", "paragraph": "Indian Rocks Beach, or IRB, is a city in Pinellas County, Florida, United States. The population was 4,286 at the 2018 census. Indian Rocks Beach is part of the Tampa-St. Petersburg-Clearwater, FL Metropolitan Statistical Area. Located on the barrier island Sand Key, it has over two miles of beach along the Gulf of Mexico, with 26 public beach accesses."}, {"url": "https://en.wikipedia.org/wiki/List_of_historical_films_set_in_Near_Eastern_and_Western_civilization", "paragraph": "The historical drama or period drama is a film genre in which stories are based upon historical events and famous people. Some historical dramas are docudramas, which attempt an accurate portrayal of a historical event or biography, to the degree that the available historical research will allow. Other historical dramas are fictionalized tales that are based on an actual person and their deeds, such as Braveheart, which is loosely based on the 13th-century knight William Wallace's fight for Scotland's independence.\nDue to the sheer volume of films included in this genre and in the interest of continuity, this list is primarily focused on films pertaining to the history of Near Eastern and Western civilization.\nFor films pertaining to the history of East Asia, Central Asia, and South Asia, please refer also to the list of Asian historical drama films.\n\n"}, {"url": "https://en.wikipedia.org/wiki/1971:_Beyond_Borders", "paragraph": "1971: Beyond Borders is a 2017 Indian Malayalam-language war film written and directed by Major Ravi. It is the fourth installment in the Major Mahadevan film series, with Mohanlal reprising his role as Colonel Mahadevan and a new character, Major Sahadevan. It also features Arunoday Singh and Allu Sirish. The film, set in two time periods, is based on the Indo-Pakistani War of 1971 and act as both prequel and follow-up to the series. Mohanlal's and Sirish's characters were modeled on Hoshiar Singh and Arun Khetarpal, both of whom were awarded the Param Vir Chakra for their roles in the 1971 Indo-Pakistani War.Dialogues were written by Shiju Nambyath for the script of Ravi. The film was shot by Sujith Vaassudev, while Gopi Sunder provided the score. Siddharth Vipin, Najim Arshad, and Rahul Subramanian composed the soundtrack. Principal photography commenced on 31 October 2016 in Suratgarh, Rajasthan and completed on 5 February 2017 in Georgia. 1971: Beyond Borders released on 7 April 2017 in India."}]